/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package cn.com.codes;

/**
 *
 * @author kete
 */
public interface BricksMessagesCodes {

    String _E00000 = "E00000"; // 异常CODE${0}未配置.
    String _E00001 = "E00001"; // 元素类型为日期,必须配置format属性.
    String _E00002 = "E00002"; // 元素类型为日期,配置format属性${0}错误.
    String _E00003 = "E00003"; // 元素类型为下拉列表,必须配置source属性.
    String _E00004 = "E00004"; // 元素类型为链接,必须配置link属性.
    String _E00005 = "E00005"; // 生成标签时字符转换对象时发生异常,请检查配置是否正确.
    String _E00006 = "E00006"; // 类${0}加载异常.
    String _E00007 = "E00007"; // 字符转换对象时发生异常.
    String _E00008 = "E00008"; // 当前的处理节点${0}不存在,请核对配置.
    String _E00009 = "E00009"; // 页面解析器不能为空.
    String _E00010 = "E00010"; // 表单模板没有对应的处理类.
    String _E00011 = "E00011"; // 未找到指定${0}的组模板处理类.
    String _E00012 = "E00012"; // 无操作${0}权限.
    String _E00013 = "E00013"; // 对象复制时源对象不能为空.
    String _E00014 = "E00014"; // 对象复制时目标对象不能为空.
    //##收料异常编号规则：E1 + 五位流水号 (00001开始)
    //##质检异常编号规则：E2 + 五位流水号
    //##交接异常编号规则： E3 + 五位流水号
    //##进仓异常编号规则： E4 + 五位流水号
    //##退料异常编号规则： E5 + 五位流水号
    //##需求异常编号规则： E6 + 五位流水号
    //##分工异常编号规则： E7 + 五位流水号
    //##备料异常编号规则：E8 + 五位流水号
    //##配送异常编号规则： E9 + 五位流水号
    //##过账异常编号规则：E10 + 五位流水号
    //##取消凭证/冲销异常编号规则：  E11 + 五位流水号
    //##任务异常编号规则： E12 + 五位流水号
    String _E1200000 = "E1200000"; // ${0}节点处理类未实现InitiationProcess接口.
    String _E1200001 = "E1200001"; // 其他用户正在操作${0}任务.
}
